YenerGunay/ESP8266_Wifi_230109/ESP8266_Html.h
/*
Page	Function
/	Menu page.
/wifi	Show WiFi scan results and enter WiFi configuration.(/0wifi noscan)
/wifisave	Save WiFi configuration information and configure device. Needs variables supplied.
http://10.10.101.254/wifi?#p

SSID
Xiaomi_Pasam

Password
aabbccddf2
 Show Password

Static IP
192.168.31.200
 Static gateway
255.255.255.0
 Subnet
192.168.31.1
 Static DNS
8.8.8.8



/param	Parameter page
/info	Information page
/u	OTA Update
/close	Close the captiveportal popup, config portal will remain active
/exit	Exit Config portal, config portal will close
/restart	Reboot the device
/erase	Erase WiFi configuration and reboot device. Device will not reconnect to a network until new WiFi configuration data is entered.
Github https://github.com/tzapu/WiFiManager.
*/


#ifndef _Esp8266_Html
#define _Esp8266_Html

#include <ESP8266WiFi.h>
// #include <DNSServer.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFiMulti.h>  // Built-in
#include <ESP8266mDNS.h>
#include <WiFiManager.h>  
#include "WiFiClient.h"



 #if defined(AtoUpdate)
#include <WiFiUdp.h>
#include <ArduinoOTA.h>
#include <ESP8266httpUpdate.h>
#endif

//  #if defined(APMode1)
  #include <ESP8266HTTPUpdateServer.h>
// //https://www.youtube.com/watch?v=iDKVbS1Yb2w
// #include <ESP8266mDNS.h>
// //ağ bilgilerinizi girin
// #ifndef STASSID
// #define STASSID "Xiaomi_Pasam"
// #define STAPSK  "aabbccddf2"
// //#define HOSTdf  "esp8266-webupdate"
// #endif


 const char* host = "Densi_Server_Ap";
// const char* ssid = STASSID;
// const char* password = STAPSK;
// #endif




#include "littleFS_Read.h"
#include <Arduino.h>
#include <EEPROM.h>
#include "CSS.h"
#include "Scale.h"
#include "myShiftDisplay.h"
//#include "FS.h"

myShiftDisplay mydisplay;

struct Settings {
    float f;
    int i;
    char s[20];
    uint32_t ip;
} sett;

littleFS_Read ltFs;
Scale scale;


ESP8266WebServer server(80);
ESP8266HTTPUpdateServer httpUpdater;

// Variable to store the HTTP request
String header;

String NetwMode ="0"; // WIFI_STA - WIFI_AP
String NetwSsid ="Densi_AP_Vinc1";
String NetwPasw ="12345678";
String NetwIpNa ="10.10.100.254";
String NetwMask ="255.255.255.0";

String SSIDName ="DENSi_SSID";
String SSIDPasw ="12345678";
String SSIDTcpi ="10.10.100.254";
String SSIDGetw ="10.10.100.1";
String SSIDMask ="255.255.255.0";


//const char* 
bool PortOnOf = 1;
String ServerIp = "10.10.100.254";
int ServerPo = 8899;


// Assign output variables to GPIO pins
class ESP8266_Html
{
private:
public:
  void AP_Mode();
  void setupHTML();
  void ESP8266_Htmlweb();
  static void ESP8266_FactoryMod();
};




void SendHTML_Content(){
  server.sendContent(webpage);
  webpage = "";
}
void SendHTML_Stop(){
  server.sendContent("");
  server.client().stop(); // Stop is needed because no content length was sent
}





//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void SendHTML_Header(){
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate"); 
  server.sendHeader("Pragma", "no-cache"); 
  server.sendHeader("Expires", "-1"); 
  server.setContentLength(CONTENT_LENGTH_UNKNOWN); 
  server.send(200, "text/html", ""); // Empty content inhibits Content-length header so we have to close the socket ourselves. 
  append_page_header();
  SendHTML_Content();
}


//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void SelectInput(String heading1, String command, String arg_calling_name){
  SendHTML_Header();
  webpage += F("<h3>"); webpage += heading1 + "</h3>"; 
  webpage += F("<FORM action='/"); webpage += command + "' method='post'>"; // Must match the calling argument e.g. '/chart' calls '/chart' after selection but with arguments!
  webpage += F("<input type='text' name='"); webpage += arg_calling_name; webpage += F("' value=''><br>");
  webpage += F("<type='submit' name='"); webpage += arg_calling_name; webpage += F("' value=''><br>");
  append_page_footer();
  SendHTML_Content();
  SendHTML_Stop();
}


//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void ReportFileNotPresent(String target){
  SendHTML_Header();
  webpage += F("<h3>File does not exist</h3>"); 
  webpage += F("<a href='/"); 
 // webpage += target + "'>[Back]</a><br><br>";
  append_page_footer();
  SendHTML_Content();
  SendHTML_Stop();
}

// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// void ReportSDNotPresent(){
//   SendHTML_Header();
//   webpage += F("<h3>No SD Card present</h3>"); 
//   webpage += F("<a href='/'>[Back]</a><br><br>");
//   append_page_footer();
//   SendHTML_Content();
//   SendHTML_Stop();
// }
//String Argument_name , client_Respons;
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void HomePage(){
  SendHTML_Header();
 // String IPaddress = WiFi.localIP().toString();
 #if defined(Lcd_7Sehment)    
      webpage += F("<h2>External 7 Seg. LCD</h2>");  
 #endif

  webpage += F("<h3>HOME PAGE</h3>");  
#if defined(FULL)    
  webpage += F("<a href='/download'><button>Download</button></a>");
  webpage += F("<a href='/upload'><button>Upload</button></a>");
  webpage += F("<a href='/dir'><button>Dir</button></a>");
  webpage += F("<a href='/label'><button>Label</button></a>");
  webpage += F("<a href='/plu'><button>Plu</button></a>");
#endif  
  webpage += F("<a href='/wifisetting'><button>Wifi Setting</button></a>");
  webpage += F("<a href='/parametre'><button>Parametre</button></a>");
  webpage += F("<a href='/update'><button>Fireware</button></a>");
  webpage += F("<a href='/ssidscan'><button>SSID Scan</button></a>");
  append_page_footer();
  SendHTML_Content();
  SendHTML_Stop(); // Stop is needed because no content length was sent
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void Reset(){
  HomePage();
  ESP.reset();
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void File_Upload(){
  append_page_header();
  webpage += F("<h3>Select File to Upload</h3>"); 
  webpage += F("<FORM action='/fupload' method='post' enctype='multipart/form-data'>");
  webpage += F("<input class='buttons' style='width:50%' type='file' name='fupload' id = 'fupload' value=''><br>");
  webpage += F("<br><button class='buttons' style='width:10%' type='submit'>Upload File</button><br>");
  //webpage += F("<a href='/'>[Back]</a><br><br>");
  append_page_footer();
  server.send(200, "text/html",webpage);
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void SD_file_download(String filename){
  SD_present = true;
  LittleFS.begin();
  //filename ="RP80VI_006.bin";
  Serial.println(SD_present);
  if (SD_present) { 
    File download = LittleFS.open(filename ,"r"); //SD.open("/"+filename);
    Serial.println("Dosya Adi");
    Serial.println(filename);
   Serial.println("Dosya Sonu.");
    if (download) {
      server.sendHeader("Content-Type", "text/text");
      server.sendHeader("Content-Disposition", "attachment; filename="+filename);
      server.sendHeader("Connection", "close");
      server.streamFile(download, "application/octet-stream");
      download.close();
    } else ReportFileNotPresent("download"); 
  } 
  //else ReportSDNotPresent();
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void File_Download(){ // This gets called twice, the first pass selects the input, the second pass then processes the command line arguments
  if (server.args() > 0 ) { // Arguments were received
    if (server.hasArg("download")) 
      SD_file_download(server.arg(0));
  }
  else SelectInput("Enter filename to download","download","download");
}



//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void ReportCouldNotCreateFile(String target){
  SendHTML_Header();
  webpage += F("<h3>Could Not Create Uploaded File (write-protected?)</h3>"); 
  webpage += F("<a href='/"); webpage += target ; webpage+=F("'>[Back]</a><br><br>");
  append_page_footer();
  SendHTML_Content();
  SendHTML_Stop();
}

void handleFileUpload(){ // upload a new file to the Filing system
  HTTPUpload& uploadfile = server.upload(); // See https://github.com/esp8266/Arduino/tree/master/libraries/ESP8266WebServer/srcv
                                            // For further information on 'status' structure, there are other reasons such as a failed transfer that could be used
  if(uploadfile.status == UPLOAD_FILE_START)
  {
    String filename = uploadfile.filename;
    if(!filename.startsWith("/")) 
      filename = "/"+filename;
    Serial.print("Upload File Name: "); 
    Serial.println(filename);
    // SD.remove(filename);                         // Remove a previous version, otherwise data is appended the file again
    // UploadFile = SD.open(filename, FILE_WRITE);  // Open the file for writing in SPIFFS (create it, if doesn't exist)

      if(LittleFS.begin()){
    Serial.println("Dosya islemleri oluşturuluyor");
  }
  else {
    Serial.println("Dosya yazma islemi Hatali");
  }
  file = LittleFS.open(filename ,"w");
//  file.write(uploadfile.buf, uploadfile.currentSize);
    filename = String();
  }
  else if (uploadfile.status == UPLOAD_FILE_WRITE)
  {
    if(file) file.write(uploadfile.buf, uploadfile.currentSize); // Write the received bytes to the file
  } 
  else if (uploadfile.status == UPLOAD_FILE_END)
  {
    if(file)          // If the file was successfully created
    {                                    
      file.close();   // Close the file again
      Serial.print("Upload Size: "); Serial.println(uploadfile.totalSize);
      webpage = "";
      append_page_header();
      webpage += F("<h3>File was successfully uploaded</h3>"); 
      webpage += F("<h2>Uploaded File Name: "); 
      webpage += uploadfile.filename+"</h2>";
      //webpage += F("<h2>File Size: "); webpage += file_size(uploadfile.totalSize) + "</h2><br>"; 
      //webpage += F("<a href='/'>[Back]</a><br><br>");
      append_page_footer();
      server.send(200,"text/html",webpage);
    } 
    else
    {
      ReportCouldNotCreateFile("upload");
    }
  }
}


//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

void Directory() {
  LittleFS.begin();
  Dir root = LittleFS.openDir("/");//DirName);
  append_page_header();
  webpage += F("<h3>All Upload Files</h3>");
  webpage += F("<table><tr><th>File Name</th><th>File Size</th></tr>");
   File file = root.openFile("r");
   while (root.next())
    {
      webpage += "<tr><td><a href='" + root.fileName() +"'>"+ root.fileName() + "</a><td>" + root.fileSize() + "</td></tr>";
      file.close();
    }
      webpage += F("</table></form><p> Mesaj olaçak</p>");
      append_page_footer();
      server.send(200, "text/html",webpage);
}



//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void Label(){
  LittleFS.begin();
  Dir root = LittleFS.openDir("/");//DirName);
  append_page_header();
  webpage += F("<h3>Label Select</h3>");
  webpage += F("<table><tr><th>File Name</th><th>File Size</th><th>Buton</th></tr>");
   File file = root.openFile("r");
   while (root.next())
    {
      if(root.fileName().startsWith("RP80VI_") > 0 )
       {
        webpage += F("<tr><td><form action='label' method='POST'> <input  type='hidden' name='label' value='"); 
        webpage += root.fileName() + "'>" + root.fileName() + "</td><td>" + root.fileSize();
        webpage += F("</td><td><input type='submit' value='Label Select' /></form> </td></tr>");
        file.close();
      }
    }
  webpage += F("</table><p> Mesaj olaçak</p>");
       append_page_footer();
      server.send(200, "text/html",webpage);

     if (server.hasArg("label")== false){ //Check if body received
            server.send(200, "text/html", "Body not received");
            return;
      }
      Serial.println(server.arg("label")); 
      labelName = server.arg("label");
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void Plu(){
  append_page_header();
  webpage += "<h3>PLU SELECT</h3>";
  webpage += "<table><tr><th>PLU Name</th><th>PLU Code</th><th>Buton</th></tr>";

  int eleman =(sizeof(_PluList)/sizeof(_PluList[0]));
  for (int i = 0; i < eleman; i++)  {
    //String no = i;
    webpage += "<tr><td><form action='plu' method='POST'> <input  type='hidden' name='plu' value='"
            + String(i) + "'>" + _PluList[i] + "</td><td>" +  _PluCodeList[i] //"PLUcode123" //
            + "</td><td><input type='submit' value='Label Select' /></form> </td></tr>";
    //webpage += "<option value='" + _PluList[i] + "'>" + _PluList[i] + "</option>";
  }
  webpage += "</table><p> Mesaj olaçak</p>";
       append_page_footer();
      server.send(200, "text/html",webpage);

     if (server.hasArg("plu")== false){ //Check if body received
            server.send(200, "text/html", "Body not received");
            return;
      }
      PluNo = server.arg("plu").toInt();
      //_varStr[_0_PluName] = server.arg("plu");
      //Serial.println(_varStr[_0_PluName]); 
      _varStr[_0_PluName] = _PluList[PluNo];
      Serial.println(_varStr[_0_PluName]); 
      ltFs.Fs_ReadPlu(PluNo);
}


