YenerGunay/ESP8266_Wifi_230109/ESP8266_Html.h
void UpdateFirmware(){
  append_page_header();
  webpage += F("<h3>Select File to Firmware</h3>"); 
  webpage += F("<FORM action='/update2' method='post' enctype='multipart/form-data'>");
  webpage += F("<input class='buttons' style='width:80%' type='file' accept='.bin,.bin.gz' name='update2'><br>");
  webpage += F("<br><button class='buttons' style='width:10%' type='submit'>Update File</button><br>");
  append_page_footer();
  server.send(200, "text/html",webpage);
}



#if defined(TarihSaat)
#include "RtcTimer.h"
RtcTimer rtc2;
#endif

bool AP_WifiWork_Sel = false;

void WiffiSetting(){
  // SendHTML_Header();
    if(server.args() > 0 ){
    for (uint8_t i = 0; i < server.args(); i++)
    {
       if(server.argName(i) =="wifisetting"){
        Serial.print(i);
        Serial.print("-");
        Serial.println(server.arg(i));
      }
    }

    NetwMode = server.arg(0);
    NetwSsid = server.arg(1);
    NetwPasw = server.arg(2);
    NetwIpNa = server.arg(3);
    NetwMask = server.arg(4);

    SSIDName = server.arg(5);
    SSIDPasw = server.arg(6);
    SSIDTcpi = server.arg(7);
    SSIDGetw = server.arg(8);
    SSIDMask = server.arg(9);
    PortOnOf = server.arg(10) == "0" ? false :true;
    ServerIp = server.arg(11);
    ServerPo = server.arg(12).toInt();

    // Serial.println(PortOnOf);
    // Serial.println(ServerIp);
    // Serial.println(ServerPo);
     ltFs_Rw.Fs_IniWrite("[Ssid]","WifiMode=", server.arg(0).c_str());
     ltFs_Rw.Fs_IniWrite("[Ssid]","NetwSsid=", server.arg(1).c_str());
     ltFs_Rw.Fs_IniWrite("[Ssid]","NetwPasw=", server.arg(2).c_str());
     ltFs_Rw.Fs_IniWrite("[Ssid]","NetwIpNa=", server.arg(3).c_str());
     ltFs_Rw.Fs_IniWrite("[Ssid]","NetwMask=", server.arg(4).c_str());

      ltFs_Rw.Fs_IniWrite("[Ssid]","SSIDName=", server.arg(5).c_str());
      ltFs_Rw.Fs_IniWrite("[Ssid]","SSIDPasw=", server.arg(6).c_str());
      ltFs_Rw.Fs_IniWrite("[Ssid]","SSIDTcpi=", server.arg(7).c_str());
      ltFs_Rw.Fs_IniWrite("[Ssid]","SSIDMask=", server.arg(8).c_str());
      ltFs_Rw.Fs_IniWrite("[Ssid]","SSIDGetw=", server.arg(9).c_str());
      ltFs_Rw.Fs_IniWrite("[Ssid]","ServerOn=", server.arg(10).c_str());
      ltFs_Rw.Fs_IniWrite("[Ssid]","ServerIp=", ServerIp.c_str());
      ltFs_Rw.Fs_IniWrite("[Ssid]","ServerPo=", server.arg(12).c_str());// (const char*)ServerPo);
       //server.send(200, "text/html",webpage);
  }
  append_page_header();
  webpage += F("<h1>Wifi Setting</h1>"); 
  webpage += F("<h2>Wifi Mode Sellect.....'"); 
  webpage += (String)WiFi.RSSI();
  webpage += F("'</h2><form action='/wifisetting' method='POST' enctype='multipart/form-data' style='text-align:left;'>");

  webpage += F("<select name='wifisetting' >");
  webpage += F("<option value='0' selected>WIFI_AP_STA</option>");
  webpage += F("<option value='1'>WIFI_AP</option>");
  webpage += F("<option value='2'>WIFI_STA</option>");
  webpage += F("</select>--Work Mode Select <br>");
// String NetwMode ="0"; // WIFI_STA - WIFI_AP
// String NetwSsid ="Densi_AP_Vinc1";
// String NetwPasw ="12345678";
// String NetwIpNa ="10.10.100.254";
// String NetwMask ="255.255.255.0";
  //webpage += F("<input type='text' name='wifisetting' value='"); webpage +=F("Ap_WifiWork_Mod"); webpage += F("'>--Wifi Work Mode<br>");
  webpage += F("<input type='text' name='wifisetting' value='")+ NetwSsid + F("'>--Network (SSID)<br>");
  webpage += F("<input type='text' name='wifisetting' value='")+ NetwPasw + F("'>--Password<br>");
  webpage += F("<input type='text' name='wifisetting' value='")+ NetwIpNa + F("'>--Ip Adress<br>");
  webpage += F("<input type='text' name='wifisetting' value='")+ NetwMask + F("'>--Mask<br>");
  webpage += F("<h2>STA Mode</h2>"); 
  webpage += F("<input type='text' name='wifisetting' value='"); webpage +=SSIDName; webpage += F("'>--Network Name (SSID)<br>");
  webpage += F("<input type='text' name='wifisetting' value='"); webpage +=SSIDPasw; webpage += F("'>--STA Password<br>");
  webpage += F("<input type='text' name='wifisetting' value='"); webpage +=SSIDTcpi; webpage += F("'>--IP adress<br>");
  webpage += F("<input type='text' name='wifisetting' value='"); webpage +=SSIDMask; webpage += F("'>--Mask<br>");
  webpage += F("<input type='text' name='wifisetting' value='"); webpage +=SSIDGetw; webpage += F("'>--Gate<br>");
  webpage += F("<h2>Socket Connecti Setting</h2>"); 
  webpage += F("<input type='text' name='wifisetting' value='"); webpage +=(String)PortOnOf; webpage += F("'>--Port On Off<br>");
  webpage += F("<input type='text' name='wifisetting' value='"); webpage +=(String)ServerIp; webpage += F("'>--Server IP Adress<br>");
  webpage += F("<input type='text' name='wifisetting' value='"); webpage +=(String)ServerPo; webpage += F("'>--Port<br>");
  webpage += F("<input type='submit' value='Wifi Setting Seve'>");
  webpage += F("</form><br>");
  append_page_footer();

  server.send(200, "text/html",webpage);
}











void SsidScan(){
  // SendHTML_Header();
  int Tnetwork = WiFi.scanNetworks();
  append_page_header();

  
  webpage += F("<h1>Wifi Setting</h1>"); 
  webpage += F("<h2>Wifi Mode Sellect.....'"); 
  webpage += (String)WiFi.RSSI();

  webpage += F("<h2>SSID SCAN 2</h2>");
  for (size_t j = 0; j < Tnetwork; j++)
  {
    int rss =WiFi.RSSI(j);
    webpage +="<div style='text-align:left; '> <a href='#p' onclick='c(this)' data-ssid='" + WiFi.SSID(j) +"'>"+ WiFi.SSID(j) +"</a>";
    webpage +="<div role='img' aria-label='"+ webpage += (String)rss + "%' title='" + (String)rss +"%' class='q q" 
    + (int)(((-100)-rss) / 18 ) + " "+ ((WiFi.encryptionType(j) == ENC_TYPE_NONE)?" ":"l" ) +" '>";
    webpage +="</div> <div class='q h'>"+ webpage += (String)rss +"%</div></div>";
    //webpage +="<div>";
  } 

 //webpage +=F("<form method='POST' action='wifisave'>");
  //webpage += F("'<form action='/wifisetting' method='POST' enctype='multipart/form-data' style='text-align:left;'>");
  webpage += F("<form action='wifisave' method='POST' style='text-align:left;'>");

//  webpage +=F("<label for='s'>SSID</label>");
//  webpage +=F("<input id='s' name='s' maxlength='32' autocorrect='off' autocapitalize='none' placeholder='Densi'><br>");
//  webpage +=F("<label for='p'>Password</label>");
//  webpage +=F("<input id='p' name='p' maxlength='64' type='password' placeholder=''>");
 //webpage +=F("<input type='checkbox' onclick='f()'> Show Password <hr><br>");

//  webpage +=F("<label for='ip'>Static IP</label><br>");
//  webpage +=F("<input id='ip' name='ip' maxlength='15' value='10.10.100.3'>");
//  webpage +=F("<label for='gw'>Static gateway</label><br>");
//  webpage +=F("<input id='gw' name='gw' maxlength='15' value='10.10.100.254'>");
//  webpage +=F("<label for='sn'>Subnet</label> <br>");
//  webpage +=F("<input id='sn' name='sn' maxlength='15' value='255.255.255.0'>");
//  webpage +=F("<label for='dns'>Static DNS</label><br><input id='dns' name='dns' maxlength='152 value='8.8.8.8'>");
 // webpage +=F("<br><br><br><button type='submit'>Save</button> </form>");




  // webpage += F("<h2>SSID</h2>"); 
  //webpage += F("<input type='text' id='s' maxlength='32' autocorrect='off' autocapitalize='none' name='wifisetting' value='"); 
  webpage +=F("<label for='s'>SSID</label>");
  webpage += F("<input id='s' maxlength='32' autocorrect='off' autocapitalize='none' name='s'  placeholder='"); 
  webpage += SSIDName; 
  webpage += F("'><br>");
  //webpage += F("'>--Network Name (SSID)<br>");

 webpage +=F("<label for='p'>Password</label>");
 webpage +=F("<input id='p' name='p' maxlength='64' type='password' placeholder='"); webpage +=SSIDPasw +"'>";
 webpage +=F("<input type='checkbox' onclick='f()'> Show Password <hr><br>");


  //webpage += F("<input type='text' for='p' name='wifisetting' value='"); webpage +=SSIDPasw; webpage += F("'>--STA Password<br>");
  webpage += F("<input type='text' name='wifisave' value='"); webpage +=SSIDTcpi; webpage += F("'>--IP adress<br>");
  webpage += F("<input type='text' name='wifisave' value='"); webpage +=SSIDMask; webpage += F("'>--Mask<br>");
  webpage += F("<input type='text' name='wifisave' value='"); webpage +=SSIDGetw; webpage += F("'>--Gate<br>");

