YenerGunay/ESP8266_Wifi_230109/ESP8266_Html.h
  webpage += F("<input type='submit' value='Wifi Setting Seve'>");
  webpage += F("</form><br>");


  //    webpage += F("<h2>SSID SCAN </h2>");

  // webpage += F("<select name='ssidSelect' >");
  // for (size_t i = 0; i < Tnetwork; i++)
  // {
  //   webpage += "<option value='" + WiFi.SSID(i) + "' " + (SSIDName == WiFi.SSID(i) ? "selected> " : "> ") +
  // (String)i+ " " + WiFi.SSID(i) + " (" + WiFi.RSSI(i) + ")"+((WiFi.encryptionType(i) == ENC_TYPE_NONE)?" ":"*" ) + "</option>";
  // }
  // webpage += F("</select>--SSID Select <br>");





//  webpage += F("<ul>");
//   for (size_t i = 0; i < Tnetwork; i++)
//   {
//     webpage += F("<li>");
//     webpage += i +1 ;
//     webpage += WiFi.SSID(i);
//     webpage += " (";
//     webpage += WiFi.RSSI(i);
//     webpage += ")";
//     webpage += (WiFi.encryptionType(i) == ENC_TYPE_NONE)?" ":"*";
//     webpage += F("</li>");
//     /* code */
//   }
//    webpage += F("</ul>");




  append_page_footer();



  server.send(200, "text/html",webpage);
}




















void Parametre_Wifi(){

//NetwMode =ltFs.Fs_IniRead("[ApMode]","NetwSsid=").c_str();
NetwSsid =ltFs.Fs_IniRead("[ApMode]","NetwSsid=").c_str();
NetwPasw =ltFs.Fs_IniRead("[ApMode]","NetwPasw=").c_str();
NetwIpNa =ltFs.Fs_IniRead("[ApMode]","NetwIpNa=").c_str();
NetwMask =ltFs.Fs_IniRead("[ApMode]","NetwMask=").c_str();

  SSIDName = ltFs.Fs_IniRead("[Ssid]","SSIDName=").c_str();
  SSIDPasw = ltFs.Fs_IniRead("[Ssid]","SSIDPasw=").c_str();
  SSIDTcpi = ltFs.Fs_IniRead("[Ssid]","SSIDTcpi=").c_str();
  SSIDGetw = ltFs.Fs_IniRead("[Ssid]","SSIDGetw=").c_str();
  SSIDMask = ltFs.Fs_IniRead("[Ssid]","SSIDMask=").c_str();

  PortOnOf = ltFs.Fs_IniRead("[Ssid]","ServerOn=").toInt();
	ServerIp = ltFs.Fs_IniRead("[Ssid]","ServerIp=").c_str();// (const char*)ltFs.Fs_IniRead("[Ssid]","ServerIp=");	
	ServerPo = ltFs.Fs_IniRead("[Ssid]","ServerPo=").toInt();
  
  Serial.println();
  Serial.print(F("Host : "));  Serial.println(ServerIp);
  Serial.print(F("Port : "));  Serial.println(ServerPo);
  //Serial.print(F("SSIDTcpi : "));  Serial.println(SSIDTcpi);

}

void Parametre_Scale(){
String Textmod = "value='No";
#if defined(TarihSaat)
  char time_format[] = "DD/MM/YYYY hh:mm:ss";
  String strDate = rtc2.datetim().toString(time_format);
  //webpage += F("<form action='http://192.168.31.86' method='POST'>"); 
  webpage += F("<form method='POST'  style='text-align:left;'>");
  webpage += F("<h3>PARAMETRE</h3>"); 
  webpage += F("<h2>Date Format: 01/31/2000 22:12:00</h2>"); 
  webpage += "<input type='text' name='Date_Time' value='" + strDate +"'><input type='submit' value='Date Time'>";
  webpage += F("</form><br>");
#endif  
  if(server.args() > 0 ){
    for (uint8_t i = 0; i < server.args(); i++)
    {
#if defined(TarihSaat)      
      if(server.argName(i) =="Date_Time"){
        Serial.println(server.arg(i));
        rtc2.DateTimeSet(server.arg(i));
      }
#endif      
       if(server.argName(i) =="GenarelFormat"){
        Serial.print(i);
        Serial.print("-");
        Serial.println(server.arg(i));        
      }
    }
      Par_TextSize = server.arg(0).toInt();
      Par_Location = server.arg(1).toInt();
      Par_WghtStrt = server.arg(2).toInt();
      Par_WghtStop = server.arg(3).toInt();
      Par_TareStrt = server.arg(4).toInt();
      Par_TareStop = server.arg(5).toInt();
      Par_UnitStrt = server.arg(6).toInt();
      Par_EndChar =  server.arg(7).c_str();

      SerailBouderate1 = server.arg(8).toInt();
      Par_TexMode =  server.arg(9) == "No" ? false : true;
      ReadChar = Par_WghtStop - Par_WghtStrt;

      ltFs_Rw.Fs_IniWrite("[Parametre]","Size=", server.arg(0).c_str());
      ltFs_Rw.Fs_IniWrite("[Parametre]","Location=", server.arg(1).c_str());
      ltFs_Rw.Fs_IniWrite("[Parametre]","WeightStart=", server.arg(2).c_str());
      ltFs_Rw.Fs_IniWrite("[Parametre]","WeightStop=", server.arg(3).c_str());
      ltFs_Rw.Fs_IniWrite("[Parametre]","TareStart=", server.arg(4).c_str());
      ltFs_Rw.Fs_IniWrite("[Parametre]","TareStop=", server.arg(5).c_str());
      ltFs_Rw.Fs_IniWrite("[Parametre]","UnitStart=", server.arg(6).c_str());
      ltFs_Rw.Fs_IniWrite("[Parametre]","EndChar=", server.arg(7).c_str());
      
      ltFs_Rw.Fs_IniWrite("[Modul]","BaudeRate=", server.arg(8).c_str());
      ltFs_Rw.Fs_IniWrite("[Parametre]","TextMode=", server.arg(9).c_str());

  }

        if(Par_TexMode){
            Textmod =" value='Yes' checked"; 
        }
        else{
            Textmod = " value='No'"; 
        }
     
     String select = "select";
  append_page_header();
  webpage += F("<h2>General Format.....'"); 
  webpage += Gosterge_html ; 
  webpage += F("'</h2><form method='POST'  style='text-align:left;'>");
  webpage += F("<input type='text' name='GenarelFormat' value='")+ (String)Par_TextSize + F("'>--Text Size<br>");
  webpage += F("<input type='text' name='GenarelFormat' value='")+ (String)Par_Location + F("'>--Location<br>");
  webpage += F("<input type='text' name='GenarelFormat' value='")+ (String)Par_WghtStrt + F("'>--Weight Start<br>");
  webpage += F("<input type='text' name='GenarelFormat' value='")+ (String)Par_WghtStop + F("'>--Weight Stop<br>");
  webpage += F("<input type='text' name='GenarelFormat' value='")+ (String)Par_TareStrt + F("'>--Tare Start<br>");
  webpage += F("<input type='text' name='GenarelFormat' value='")+ (String)Par_TareStop + F("'>--Tare Stop<br>");
  webpage += F("<input type='text' name='GenarelFormat' value='")+ (String)Par_UnitStrt + F("'>--Unit Start<br>");
  webpage += F("<input type='text' name='GenarelFormat' value='")+ (String)Par_EndChar + F("'>--End Char<br><br>");

  webpage += F("<select name='GenarelFormat' >");
  webpage += F("<option value='9600' "); webpage += SerailBouderate1 == 9600 ? "selected" : ""; webpage +=  F(">9600</option>");  // selected>9600</option>");
  webpage += F("<option value='19200' "); webpage += SerailBouderate1 == 19200 ? "selected" : ""; webpage +=  F(">19200</option>");
  webpage += F("<option value='38400' "); webpage += SerailBouderate1 == 38400 ? "selected" : ""; webpage +=  F(">38400</option>");
  webpage += F("<option value='57600' "); webpage += SerailBouderate1 == 57600 ? "selected" : ""; webpage +=  F(">57600</option>");
  webpage += F("<option value='115200' "); webpage += SerailBouderate1 == 115200 ? "selected" : ""; webpage +=  F(">115200</option>");
  webpage += F("</select>--Seri Port Bauderate <br><br>");

  webpage += F("<input type='checkbox' id='Revers' name='GenarelFormat'");  webpage += Textmod;  webpage +=F(">--Text Mode Revers<br><br>");
  webpage += F("<input type='hidden' id='Revers' name='GenarelFormat' value='No' name='GenarelFormat' >");

