YenerGunay/ESP8266_Wifi_230109/ESP8266_Html.h
  webpage += F("<input type='submit' value='Genarel Format Save'>");
  webpage += F("</form><br>");
  append_page_footer();
  server.send(200, "text/html",webpage);
}






WiFiManager wifiManager;
void saveWifiCallback(){
  // // myWiFiManager->setAPStaticIPConfig(IPAddress(10,0,1,1), IPAddress(10,0,1,1), IPAddress(255,255,255,0)); 

    SSIDName =wifiManager.getWiFiSSID();
    SSIDPasw =wifiManager.getWiFiPass();

    SSIDTcpi = WiFi.localIP().toString();
    SSIDGetw = WiFi.gatewayIP().toString();
    //SSIDMask ="255.255.255.0";

    ltFs_Rw.Fs_IniWrite("[Ssid]","SSIDName=", SSIDName.c_str());
    ltFs_Rw.Fs_IniWrite("[Ssid]","SSIDPasw=", SSIDPasw.c_str());
    ltFs_Rw.Fs_IniWrite("[Ssid]","SSIDTcpi=", SSIDTcpi.c_str());
    //ltFs_Rw.Fs_IniWrite("[Ssid]","SSIDMask=", server.arg(8).c_str());
    ltFs_Rw.Fs_IniWrite("[Ssid]","SSIDGetw=", SSIDGetw.c_str());
}

String getParam(String name){
  //read parameter from server, for customhmtl input
  String value;
  if(wifiManager.server->hasArg(name)) {
    value = wifiManager.server->arg(name);
  }
  return value;
}

void saveParamCallback(){
   // Serial.println("PARAM customfieldid = " + getParam("customfieldid"));
    Serial.println("PARAM textSize = " + getParam("textSize"));
    Serial.println("PARAM Location = " + getParam("Location"));
    Serial.println("PARAM WeightStr = " + getParam("WeightStr"));
    Serial.println("PARAM WeightStp = " + getParam("WeightStp"));
    Serial.println("PARAM EndChar = " + getParam("EndChar"));
    Serial.println("PARAM Baudrate = " + getParam("Baudrate"));
    Serial.println("***************************************");
   // Serial.println(textSize);

      ltFs_Rw.Fs_IniWrite("[Parametre]","Location=", getParam("Location").c_str());;
      ltFs_Rw.Fs_IniWrite("[Parametre]","WeightStart=", getParam("WeightStr").c_str());
      ltFs_Rw.Fs_IniWrite("[Parametre]","WeightStop=", getParam("WeightStp").c_str());
      ltFs_Rw.Fs_IniWrite("[Parametre]","EndChar=", getParam("EndChar").c_str());
      
      ltFs_Rw.Fs_IniWrite("[Modul]","BaudeRate=", getParam("Baudrate").c_str());

  // strcpy(textSize, custom_TextSize.getValue());
  // // strcpy(mqtt_port, custom_mqtt_port.getValue());
  // // strcpy(api_token, custom_api_token.getValue());
  // Serial.println("The values in the file are: ");
  // Serial.println("\tmqtt_server : " + String(textSize));
}



#if defined(ConfigCallBack)
void handleRoute(){
  Serial.println("[HTTP] handle route2222222222");
  wifiManager.server->send(200, "text/plain", "hello from user code");
}


void bindServerCallback(){
  wifiManager.server->on("/custom",handleRoute); // this is now crashing esp32 for some reason
    Serial.println("[CALLBACK] saveParamCallback bind 6666666666");
    Serial.println(WiFi.localIP());
    Serial.println(WiFi.gatewayIP());
  // wm.server->on("/info",handleRoute); // you can override wm!
}

void handlePreOtaUpdateCallback(){
  Update.onProgress([](unsigned int progress, unsigned int total) {
        Serial.printf("CUSTOM Progress: %u%%\r", (progress / (total / 100)));
  });
}


void saveConfigCallback () {
  Serial.println("Should save config");
 // shouldSaveConfig = true;
}
#endif



void configModeCallback (WiFiManager *myWiFiManager) {
  Serial.println("Entered config mode");
  mydisplay.showDisplay7S("config", 500, Par_Point);
  Serial.println(WiFi.softAPIP());
  Serial.println(myWiFiManager->getConfigPortalSSID());
}



void my_wifimanager(){

#if defined(ConfigCallBack)
  WiFiManagerParameter custom_html("<p style=\"color:pink;font-weight:Bold;\">This Is Custom HTML</p>"); // only custom html
  WiFiManagerParameter custom_mqtt_server("server", "mqtt server", "", 40);
  WiFiManagerParameter custom_mqtt_port("port", "mqtt port", "", 6);
  WiFiManagerParameter custom_token("api_token", "api token", "", 16);
  WiFiManagerParameter custom_tokenb("invalid token", "invalid token", "", 0); // id is invalid, cannot contain spaces
  WiFiManagerParameter custom_ipaddress("input_ip", "input IP", "", 15,"pattern='\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}'"); // custom input attrs (ip mask)
  WiFiManagerParameter custom_input_type("input_pwd", "input pass", "", 15,"type='password'"); // custom input attrs (ip mask)
  const char _customHtml_checkbox[] = "type=\"checkbox\""; 
  WiFiManagerParameter custom_checkbox("my_checkbox", "My Checkbox", "T", 2, _customHtml_checkbox,WFM_LABEL_AFTER);

  const char *bufferStr = R"(
  <!-- INPUT CHOICE -->
  <br/>
  <p>Select Choice</p>
  <input style='display: inline-block;' type='radio' id='choice1' name='program_selection' value='1'>
  <label for='choice1'>Choice1</label><br/>
  <input style='display: inline-block;' type='radio' id='choice2' name='program_selection' value='2'>
  <label for='choice2'>Choice2</label><br/>

  <!-- INPUT SELECT -->
  <br/>
  <label for='input_select'>Label for Input Select</label>
  <select name="input_select" id="input_select" class="button">
  <option value="0">Option 1</option>
  <option value="1" selected>Option 2</option>
  <option value="2">Option 3</option>
  <option value="3">Option 4</option>
  </select>
  )";

WiFiManagerParameter custom_html_inputs(bufferStr);
 IPAddress ip11,gw11,msk11;
 ip11.fromString("192.168.100.1");
 gw11.fromString("192.168.100.100");
 msk11.fromString("255.255.255.0");
  wifiManager.setAPCallback(configModeCallback);
  wifiManager.setWebServerCallback(bindServerCallback);
  wifiManager.setSaveConfigCallback(saveWifiCallback);
  wifiManager.setSaveParamsCallback(saveParamCallback);
  wifiManager.setPreOtaUpdateCallback(handlePreOtaUpdateCallback);
  wifiManager.setAPStaticIPConfig(ip11,gw11,msk11);

  // add all your parameters here
  wifiManager.addParameter(&custom_html);
  wifiManager.addParameter(&custom_mqtt_server);
  wifiManager.addParameter(&custom_mqtt_port);
  wifiManager.addParameter(&custom_token);
  wifiManager.addParameter(&custom_tokenb);
  wifiManager.addParameter(&custom_ipaddress);
  wifiManager.addParameter(&custom_checkbox);
  wifiManager.addParameter(&custom_input_type);
   wifiManager.addParameter(&custom_html_inputs);

