YenerGunay/ESP8266_Wifi_230109/ESP8266_Html.h
  const char* headhtml = "<meta name='color-scheme' content='dark light'><style></style><script></script>";
  wifiManager.setCustomHeadElement(headhtml);

  const char* menuhtml = "<form action='/custom' method='get'><button>Custom</button></form><br/>\n";
  wifiManager.setCustomMenuHTML(menuhtml);

std::vector<const char *> menu = {"wifi","wifinoscan","info","param","custom","close","sep","erase","update","restart","exit"};



wifiManager.setMenu(menu);
#endif


  // const char* headhtml = "<link rel='icon' type='image/png' href='data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAADAAAAAwCAYAAABXAvmHAAADQElEQVRoQ+2YjW0VQQyE7Q6gAkgFkAogFUAqgFQAVACpAKiAUAFQAaECQgWECggVGH1PPrRvn3dv9/YkFOksoUhhfzwz9ngvKrc89JbnLxuA/63gpsCmwCADWwkNEji8fVNgotDM7osI/x777x5l9F6JyB8R4eeVql4P0y8yNsjM7KGIPBORp558T04A+CwiH1UVUItiUQmZ2XMReSEiAFgjAPBeVS96D+sCYGaUx4cFbLfmhSpnqnrZuqEJgJnd8cQplVLciAgX//Cf0ToIeOB9wpmloLQAwpnVmAXgdf6pwjpJIz+XNoeZQQZlODV9vhc1Tuf6owrAk/8qIhFbJH7eI3eEzsvydQEICqBEkZwiALfF70HyHPpqScPV5HFjeFu476SkRA0AzOfy4hYwstj2ZkDgaphE7m6XqnoS7Q0BOPs/sw0kDROzjdXcCMFCNwzIy0EcRcOvBACfh4k0wgOmBX4xjfmk4DKTS31hgNWIKBCI8gdzogTgjYjQWFMw+o9LzJoZ63GUmjWm2wGDc7EvDDOj/1IVMIyD9SUAL0WEhpriRlXv5je5S+U1i2N88zdPuoVkeB+ls4SyxCoP3kVm9jsjpEsBLoOBNC5U9SwpGdakFkviuFP1keblATkTENTYcxkzgxTKOI3jyDxqLkQT87pMA++H3XvJBYtsNbBN6vuXq5S737WqHkW1VgMQNXJ0RshMqbbT33sJ5kpHWymzcJjNTeJIymJZtSQd9NHQHS1vodoFoTMkfbJzpRnLzB2vi6BZAJxWaCr+62BC+jzAxVJb3dmmiLzLwZhZNPE5e880Suo2AZgB8e8idxherqUPnT3brBDTlPxO3Z66rVwIwySXugdNd+5ejhqp/+NmgIwGX3Py3QBmlEi54KlwmjkOytQ+iJrLJj23S4GkOeecg8G091no737qvRRdzE+HLALQoMTBbJgBsCj5RSWUlUVJiZ4SOljb05eLFWgoJ5oY6yTyJp62D39jDANoKKcSocPJD5dQYzlFAFZJflUArgTPZKZwLXAnHmerfJquUkKZEgyzqOb5TuDt1P3nwxobqwPocZA11m4A1mBx5IxNgRH21ti7KbAGiyNn3HoF/gJ0w05A8xclpwAAAABJRU5ErkJggg==' />";
  // //const char* headhtml = "<meta name='color-scheme' content='dark light'><style></style><script></script>";
  // wifiManager.setCustomHeadElement(headhtml);
  char textSize[10];
  //sprintf(textSize, "%04d", Par_TextSize);
    itoa( Par_TextSize , textSize ,10);
 // WiFiManagerParameter custom_html1("<link rel='icon' type='image/png' href='data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAADAAAAAwCAYAAABXAvmHAAADQElEQVRoQ+2YjW0VQQyE7Q6gAkgFkAogFUAqgFQAVACpAKiAUAFQAaECQgWECggVGH1PPrRvn3dv9/YkFOksoUhhfzwz9ngvKrc89JbnLxuA/63gpsCmwCADWwkNEji8fVNgotDM7osI/x777x5l9F6JyB8R4eeVql4P0y8yNsjM7KGIPBORp558T04A+CwiH1UVUItiUQmZ2XMReSEiAFgjAPBeVS96D+sCYGaUx4cFbLfmhSpnqnrZuqEJgJnd8cQplVLciAgX//Cf0ToIeOB9wpmloLQAwpnVmAXgdf6pwjpJIz+XNoeZQQZlODV9vhc1Tuf6owrAk/8qIhFbJH7eI3eEzsvydQEICqBEkZwiALfF70HyHPpqScPV5HFjeFu476SkRA0AzOfy4hYwstj2ZkDgaphE7m6XqnoS7Q0BOPs/sw0kDROzjdXcCMFCNwzIy0EcRcOvBACfh4k0wgOmBX4xjfmk4DKTS31hgNWIKBCI8gdzogTgjYjQWFMw+o9LzJoZ63GUmjWm2wGDc7EvDDOj/1IVMIyD9SUAL0WEhpriRlXv5je5S+U1i2N88zdPuoVkeB+ls4SyxCoP3kVm9jsjpEsBLoOBNC5U9SwpGdakFkviuFP1keblATkTENTYcxkzgxTKOI3jyDxqLkQT87pMA++H3XvJBYtsNbBN6vuXq5S737WqHkW1VgMQNXJ0RshMqbbT33sJ5kpHWymzcJjNTeJIymJZtSQd9NHQHS1vodoFoTMkfbJzpRnLzB2vi6BZAJxWaCr+62BC+jzAxVJb3dmmiLzLwZhZNPE5e880Suo2AZgB8e8idxherqUPnT3brBDTlPxO3Z66rVwIwySXugdNd+5ejhqp/+NmgIwGX3Py3QBmlEi54KlwmjkOytQ+iJrLJj23S4GkOeecg8G091no737qvRRdzE+HLALQoMTBbJgBsCj5RSWUlUVJiZ4SOljb05eLFWgoJ5oY6yTyJp62D39jDANoKKcSocPJD5dQYzlFAFZJflUArgTPZKZwLXAnHmerfJquUkKZEgyzqOb5TuDt1P3nwxobqwPocZA11m4A1mBx5IxNgRH21ti7KbAGiyNn3HoF/gJ0w05A8xclpwAAAABJRU5ErkJggg==' />");
  WiFiManagerParameter custom_html("<p style='color:pink;font-weight:Bold;'>Parametre</p>"); // only custom html
  WiFiManagerParameter custom_TextSize("textSize", "Textsize", textSize, 3);
    itoa( Par_Location , textSize ,10);
  WiFiManagerParameter custom_Location("Location", "Location", textSize ,2);
    itoa( Par_WghtStrt , textSize ,10);
  WiFiManagerParameter custom_WeightStr("WeightStr", "WeightStr", textSize, 2);
    itoa( Par_WghtStop , textSize ,10);
  WiFiManagerParameter custom_WeightStp("WeightStp", "WeightStp", textSize, 2);
  
  WiFiManagerParameter custom_EndChar("EndChar", "EndChar", Par_EndChar.c_str() , 2);
    itoa( SerailBouderate1 , textSize ,10);
  WiFiManagerParameter custom_Baudrate("Baudrate", "Baudrate", textSize , 8);

  // WiFiManagerParameter custom_ipaddress("input_ip", "input IP", "", 15,"pattern='\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}\\.\\d{1,3}'"); // custom input attrs (ip mask)
  // WiFiManagerParameter custom_input_type("input_pwd", "input pass", "", 15,"type='password'"); // custom input attrs (ip mask)
  // const char _customHtml_checkbox[] = "type=\"checkbox\""; 
  // WiFiManagerParameter custom_checkbox("my_checkbox", "My Checkbox", "T", 2, _customHtml_checkbox,WFM_LABEL_AFTER);

 //new (&custom_field) WiFiManagerParameter("customfieldid", "Custom Field Label", "Custom Field Value", customFieldLength,"placeholder=\"Custom Field Placeholder\" type=\"checkbox\""); // custom html type

  // add all your parameters here
  //wifiManager.addParameter(&custom_html1);
  wifiManager.addParameter(&custom_html);
  wifiManager.addParameter(&custom_TextSize);
  wifiManager.addParameter(&custom_Location);
  wifiManager.addParameter(&custom_WeightStr);
  wifiManager.addParameter(&custom_WeightStp);
  wifiManager.addParameter(&custom_EndChar);
  wifiManager.addParameter(&custom_Baudrate);


  // const char* menu[] = {"wifi","wifinoscan","info","param","close","sep","erase","restart","exit"};
  // wifiManager.setMenu(menu,9); // custom menu array must provide length
  std::vector<const char *> menu = {"wifi","wifinoscan","sep","param","sep","erase","update","restart","exit"};
    wifiManager.setMenu(menu);
    wifiManager.setSaveParamsCallback(saveParamCallback);
    wifiManager.setSaveConfigCallback(saveWifiCallback);
    wifiManager.setAPCallback(configModeCallback);
     
    // wifiManager.setSaveConnect(configModeCallback);




  IPAddress _ip, _gw, _sn, _ip1, _gw1, _sn1, _dns1 ,_NetwIpNa, _NetwMask;
  _ip1.fromString(SSIDTcpi);
  _gw1.fromString(SSIDGetw);
  _sn1.fromString(SSIDMask);
  _dns1.fromString("8.8.8.8");

  wifiManager.setAPStaticIPConfig(_ip, _gw, _sn);
  wifiManager.preloadWiFi(SSIDName , SSIDPasw);
  wifiManager.setSTAStaticIPConfig(_ip1,_gw1,_sn1,_dns1);
  wifiManager.setDarkMode(true);


