YenerGunay/ESP8266_Wifi_230109/ESP8266_Html.h
    //wifiManager.setConfigPortalTimeout(180);
    //wifiManager.setConnectTimeout(60);
    //wifiManager.setTimeout(15);
   // wifiManager.resetSettings();
    if(!wifiManager.autoConnect(NetwSsid.c_str(), NetwPasw.c_str())) {   // .autoConnect
    Serial.println("failed to connect and hit timeout");
    //reset and try again, or maybe put it to deep sleep
  //  ESP.reset();    
  //    wifiManager.setTimeout(180);
    mydisplay.showDisplay7S("delay", 200, Par_Point);
    ESP.restart();
  } 
  //  Serial.println("Exit AP");
  //WiFi.setAutoReconnect(false);

  // WiFi.setAutoReconnect(trTestue);
  //  WiFi.persistent(flase);
  // wifiConectStatus =WiFi.onStationModeGotIP(ConnectTodo);

}


void ESP8266_Html::AP_Mode(){
//https://www.youtube.com/watch?v=XZC6Ucxn4bE

WiFi.mode(WIFI_AP_STA);
delay(1000);
  IPAddress _ip, _gw, _sn, _ip1, _gw1, _sn1, _dns1 ,_NetwIpNa, _NetwMask, _NetwGetw;
  _ip = IPAddress(10, 10, 100, 254);
  _gw = IPAddress(10, 10, 100, 1);
  _sn = IPAddress(255, 255, 255, 0);

if(WiFi.begin(SSIDName,SSIDPasw)) {
      String str = WiFi.localIP().toString();
      //str = str.substring(str.length()-6, str.length());
      Serial.println(str);
      mydisplay.showDisplay7S(str ,100,0);
        clearDisplay();
  }

_NetwIpNa.fromString(NetwIpNa);
_NetwMask.fromString(NetwMask);
  // WiFi.begin(NetwSsid, NetwPasw);
  // WiFi.hostname("CV19Archimede");
 //_dns1.fromString("10.10.101.254");//"8.8.8.8");
  WiFi.softAPConfig(_NetwIpNa, _NetwIpNa, _NetwMask);//, _dns1); 
  //WiFi.setAutoConnect(true);
  WiFi.softAP(NetwSsid, NetwPasw , 2 , 0 ,2 );//, 100);

  // while (WiFi.waitForConnectResult() != WL_CONNECTED) {
  //   WiFi.begin(NetwSsid, NetwPasw);
  //   Serial.println("WiFi failed, retrying.");
  // }
 
  // MDNS.begin(host);
//  httpUpdater.setup(&server);


 // WiFi.add
 // WiFi.softAPIP();
  // dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
  // dnsServer.start(DNS_PORT, "*", _dns1);
  // server.on("/", handleRoot);
  // server.begin();
  //MDNS.begin();
 // WiFi.softAPDhcpServer();
  //return;
//   if (!WiFi.config(local_IP, gateway, subnet, primaryDNS, secondaryDNS)) {
//     Serial.println("STA Failed to configure");
// }
  //wifiManager.resetSettings();
  // //  wifiManager.setConfigPortalTimeout(timeout);
 //  wifiManager.setAPCallback(configModeCallback);

my_wifimanager();


// wifiAbortStatus =WiFi.onStationModeDisconnected(ConnectBreak);
//Serial.println(WiFi.RSSI());

/*

_NetwIpNa.fromString(NetwIpNa);
_NetwMask.fromString(NetwMask);
 //_dns1.fromString("10.10.101.254");//"8.8.8.8");
  IPAddress gateway(10,10,101,1);

  //WiFi.softAPConfig(_NetwIpNa, _NetwIpNa, _NetwMask);//, _dns1); 
  WiFi.softAPConfig(_NetwIpNa, _NetwIpNa, _NetwMask);//, _dns1); 
  
   WiFi.softAP(NetwSsid, NetwPasw, 2, 0, 1 , 100);
   return;
 if( WiFi.softAP(NetwSsid, NetwPasw, 2, 0, 1 , 100)) {
    Serial.print("WiFi.softAPIP() :");
    Serial.println(WiFi.softAPIP());
 }
*/


}


void ESP8266_Html::ESP8266_FactoryMod(){ 
    ltFs.FileCreate(_Menu_Start,"/net.ini");
    mydisplay.showDisplay7S("AP Mod" ,100 , 0);
    WiFi.mode(WIFI_AP);//WIFI_STA);
    wifiManager.resetSettings();
    wifiManager.setConfigPortalTimeout(timeout);
    wifiManager.reboot();
 }




//ESP-86A80E
WiFiClient client ;

void ESP8266_Html::setupHTML(){
Parametre_Wifi();

  AP_Mode();

  server.on("/",         HomePage);

  server.on("/dir",      Directory);
  server.on("/download", File_Download);
  server.on("/upload",   File_Upload);
  server.on("/fupload",  HTTP_POST,[](){ server.send(200);}, handleFileUpload);
#if defined(FULL)
   server.on("/label",    Label);
   server.on("/plu",      Plu);
#endif 
  server.on("/factorymod",    ESP8266_FactoryMod);
   server.on("/parametre",    Parametre_Scale);
   server.on("/wifisetting",  WiffiSetting);
   server.on("/ssidscan",  SsidScan);
   server.on("/espreset",   Reset);
   //server.on("/body",     Plu);   // Kontrol edileçek nasıl çalıştığını anlamadım
   server.on("/update",   UpdateFirmware);
   httpUpdater.setup(&server ,"/update2");
  // server.on("/tennisracket", HTTP_GET, [](AsyncWebServerRequest * request) {
  //   request->send(LittleFS , "/tennisracket.jfif", "image/jfif");
  // });


   server.begin();
  

    client.connect(ServerIp,ServerPo);
 }















int ClientRst;// =0;
int rssCount;
bool WMISBLOCKING    = true; 
void ESP8266_Html::ESP8266_Htmlweb(){
  // if(!WMISBLOCKING){
  //   wifiManager.process();
  // }
  server.handleClient();
    mydisplay.showDisplay7S(Gosterge, 1, Par_Point);
if(PortOnOf) {
  String Oku;

  if(client) {                             // If a new client connects,
    mydisplay.showDisplay7S("Hst Ok", 1, 0);
    mydisplay.show(25);
    Serial.println("Host Ok");
    ClientRst=0;     
    while (client.connected())    {
       ClientRst++;
       server.handleClient();
      if (client.available()) {             // if there's bytes to read from the client,
        char c = client.read();  
        Oku += c;
        
          if(c == Par_endChr){
            //if(buf_vinc != Oku && Oku.length() > 5){// && Oku.length() < 11)  {  // Oku da 4 karekter = ise okumaya devam et
            if(Oku.length() > (size_t)(Par_TextSize - 1)){

              //  rssCount++;
              // if(rssCount < 2000)              {
              //    Gosterge = "fi" + (String)WiFi.RSSI();
              // }else if(rssCount > 4000) {
              //   scale.DisplayGeneral(Oku, false);
              //   rssCount=0;
              // }
               // Gosterge = "fi" + (String)WiFi.RSSI();
                scale.DisplayGeneral(Oku, false);
                mydisplay.showDisplay7S(Gosterge, 1, Par_Point);
                Oku="";           
               ClientRst=0; 
             }
          }

       }
      else if ( digitalRead(TRIGGER_PIN_PRINT) == LOW ){
      //ltFs.Fs_ReadLabel(labelName);
             Serial.println(ltFs.Fs_IniRead("/net.ini"));
           Serial.print("Chr :");    Serial.println(Par_endChr);
           delay(100);
           Serial.print("Par_textmode :"); Serial.println(Par_TexMode);
        delay(100);
        }
        else if ( digitalRead(TRIGGER_PIN_FS) == LOW ){
            ESP8266_FactoryMod();
           delay(100);
        }

              //  rssCount++;
              // if(rssCount < 500)              {
              //    Gosterge = "fi" + (String)WiFi.RSSI();
              //    mydisplay.digit7segment(Gosterge, 1, Par_Point);
              // }else if(rssCount >= 500 && rssCount < 1000) {
              //    mydisplay.digit7segment(Gosterge, 1, Par_Point);              
              // }else{
              //   rssCount=0;
              // }

     if(ClientRst >5000){
        client.stop(); 
        Serial.println("Wifi Reset");
        Serial.println(WiFi.RSSI());
        if(client.connect(ServerIp,ServerPo))
          Gosterge = "fi" + (String)WiFi.RSSI();
        
        ClientRst =0;
     }
      
