YenerGunay/ESP8266_Wifi_230109/ESP8266_Html.h
      //mydisplay.show(1);
    }
 }else{
  //mydisplay.digit7segment("Hst No", 200, 0);
   Gosterge = "Hst No";
  Serial.print(".");
  //Serial.print("Host No");
  ClientRst++;
  //Serial.println(ClientRst);
  mydisplay.showDisplay7S("Hst No", 10, 0); 
  if(ClientRst > 250){
    //Serial.print("Host Waiting :")
    mydisplay.showDisplay7S("re Cnc", 500, 0);
    client.connect(ServerIp,ServerPo);
    ClientRst = 0;
  }
 
 }

  }

   
}

/**
//return;
//  WiFiClient client = server1.available();   // Listen for incoming clients
//   if (client) {                             // If a new client connects,
//     Serial.println("New Client.");          // print a message out in the serial port
//     String currentLine = "";                // make a String to hold incoming data from the client
//     while (client.connected()) {            // loop while the client's connected
//       if (client.available()) {             // if there's bytes to read from the client,
//         char c = client.read();             // read a byte, then
//         Serial.write(c);                    // print it out the serial monitor
//         // header += c;
//         // if (c == '\n') {                    // if the byte is a newline character
//         //   // if the current line is blank, you got two newline characters in a row.
//         //   // that's the end of the client HTTP request, so send a response:
//         //   if (currentLine.length() == 0) {
//         //     // HTTP headers always start with a response code (e.g. HTTP/1.1 200 OK)
//         //     // and a content-type so the client knows what's coming, then a blank line:
//         //     client.println("HTTP/1.1 200 OK");
//         //     client.println("Content-type:text/html");
//         //     client.println("Connection: close");
//         //     client.println();
//         //     // turns the GPIOs on and off
//         //     if (header.indexOf("GET /5/on") >= 0) {
//         //       Serial.println("GPIO 5 on");
//         //       output5State = "on";
//         //       digitalWrite(output5, HIGH);
//         //     } else if (header.indexOf("GET /5/off") >= 0) {
//         //       Serial.println("GPIO 5 off");
//         //       output5State = "off";
//         //       digitalWrite(output5, LOW);
//         //     } else if (header.indexOf("GET /4/on") >= 0) {
//         //       Serial.println("GPIO 4 on");
//         //       output4State = "on";
//         //       digitalWrite(output4, HIGH);
//         //     } else if (header.indexOf("GET /4/off") >= 0) {
//         //       Serial.println("GPIO 4 off");
//         //       output4State = "off";
//         //       digitalWrite(output4, LOW);
//         //     }else if (header.indexOf("?") >= 0) {
//         //       //dataConvert(header);
//         //       Serial.println("Port No:");
//         //       //GET /?txtSsid=Xiaomi_Pasam&txtPasw=aabbccddf1&txtTcpi=192.168.31.148&txtPort=8899 HTTP/1.1
//         //       //Xiaomi_Pasam&txtPasw=aabbc
//         //       int strindex = header.indexOf('?');
//         //        int index = header.indexOf(" HTTP/");
//         //        String str =header.substring((strindex + 1) , index);
//         //        Serial.println(str);
//         //        dataConvert(str, '&'); 
//         //        dataConvert(strs[3], '='); 
//         //        SSIDPort = strs[1];
//         //       //SSIDPort = str;
//         //        Serial.println(SSIDPort);
//         //     }
//         //     // append_page_header();
//         //     // append_page_footer();
//         //     // SendHTML_Content();
//         //       // SendHTML_Stop();
//         //     // return;
//         //     // Display the HTML web page
//         //     client.println("<!DOCTYPE html><html>");
//         //     client.println("<head><meta name=\"viewport\" content=\"width=device-width, initial-scale=1\">");
//         //     client.println("<link rel=\"icon\" href=\"data:,\">");
//         //     // CSS to style the on/off buttons 
//         //     // Feel free to change the background-color and font-size attributes to fit your preferences
//         //     client.println("<style>html { font-family: Helvetica; display: inline-block; margin: 0px auto; text-align: center;}");
//         //     client.println(".button { background-color: #195B6A; border: none; color: white; padding: 16px 40px;");
//         //     client.println("text-decoration: none; font-size: 30px; margin: 2px; cursor: pointer;}");
//         //     client.println(".button2 {background-color: #77878A;}</style></head>");
//         //     // Web Page Heading
//         //     client.println("<body><h1>Densi Web Server</h1>");
//         //     // Display current state, and ON/OFF buttons for GPIO 5  
//         //     client.println("<p>GPIO 5 - State " + output5State + "</p>");
//         //     // If the output5State is off, it displays the ON button       
//         //     if (output5State=="off") {
//         //       client.println("<p><a href=\"/5/on\"><button class=\"button\">ON</button></a></p>");
//         //     } else {
//         //       client.println("<p><a href=\"/5/off\"><button class=\"button button2\">OFF</button></a></p>");
//         //     } 
//         //     // Display current state, and ON/OFF buttons for GPIO 4  
//         //     client.println("<p>GPIO 4 - State " + output4State + "</p>");
//         //     // If the output4State is off, it displays the ON button       
//         //     if (output4State=="off") {
//         //       client.println("<p><a href=\"/4/on\"><button class=\"button\">ON</button></a></p>");
//         //     } else {
//         //       client.println("<p><a href=\"/4/off\"><button class=\"button button2\">OFF</button></a></p>");
//         //     }
//         //     client.println("<form>");
//         //     client.println("SSID :    <input type=\"text\" id=\"txtSsid\" name=\"txtSsid\" value=\"" + SSIDName + "\"> </br>");
//         //     client.println("Pasword : <input type=\"text\" id=\"txtPasw\" name=\"txtPasw\" value=\"" + SSIDPasw + "\"> </br>");
//         //     client.println("TCPIP :   <input type=\"text\" id=\"txtTcpi\" name=\"txtTcpi\" value=\"" + SSIDTcpi + "\"> </br>");
//         //     client.println("Port :    <input type=\"text\" id=\"txtPort\" name=\"txtPort\" value=\"" + SSIDPort + "\"> </br>");
//         //     client.println("<input type=\"submit\" value=\"Send\">");
//         //     client.println("</form>");
//         //     client.println("</body></html>");
//         //     // The HTTP response ends with another blank line
//         //     client.println();
//         //     // Break out of the while loop
//         //     break;
//         //   } else { // if you got a newline, then clear currentLine
//         //     currentLine = "";
//         //   }
//         // } else if (c != '\r') {  // if you got anything else but a carriage return character,
//         //   currentLine += c;      // add it to the end of the currentLine
//         // }
//       }
//     }
//     // Clear the header variable
//     header = "";
//     // Close the connection
//     client.stop();
//     Serial.println("Client disconnected.");
//     Serial.println("");
//   }
//}

// void ESP8266_Html::dataConvert(String str,char ch)
// {
//   int StringCount = 0;
//   // Split the string into substrings
//   while (str.length() > 0)
//   {
//     int index = str.indexOf(ch);
//     if (index == -1) // No space found
//     {
//       strs[StringCount++] = str;
//       break;
//     }
//     else
//     {
//       strs[StringCount++] = str.substring(0, index);
//       str = str.substring(index+1);
//     }
//   }

//      for (int i = 0; i < StringCount; i++)
//    {
//      Serial.print(i);
//      Serial.print(": ");
//      Serial.print(strs[i]);
//      Serial.println();
//      //delay(50);
//    }
//   // Serial.println("header:");
//   // Serial.println(header);
//   // //GET /?txtSsid=Xiaomi_Pasam&txtPasw=aabbccddf1&txtTcpi=192.168.31.148&txtPort=8899 HTTP/1.1
//   // int index = header.lastIndexOf('&');
//   // Serial.println("index:");
//   // Serial.println(index);
//   // int lenght = header.length();
//   // Serial.println("lenght:");
//   // Serial.println(lenght);
//   // String sub_s = header.substring(index,lenght);
//   // Serial.println("sub_s:");
//   // Serial.println(sub_s);
//   // //output4State = "off";
//   // //digitalWrite(output4, LOW);
// }
*/

#endif